a52dec
aalib
accounts-qml-module
accountsservice
acl
acpi
adobe-source-code-pro-fonts
adobe-source-han-serif-otc-fonts
adwaita-icon-theme
alsa-card-profiles
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
android-tools
android-udev
aom
appmenu-gtk-module
appstream
appstream-qt
archlinux-appstream-data
archlinux-keyring
arduino
arduino-builder
arduino-ctags
argon2
ark
at-spi2-atk
at-spi2-core
atk
atkmm
attica
attr
audiofile
audit
autoconf
automake
autopep8
avahi
baloo
baloo-widgets
base
bash
bat
bc
bcg729
binutils
bison
bluedevil
bluez
bluez-libs
bluez-qt
bluez-utils
bolt
boost-libs
bpytop
breeze
breeze-gtk
breeze-icons
bridge-utils
brltty
brotli
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
cantarell-fonts
ccache
cdparanoia
celt
cfitsio
chmlib
cifs-utils
cmake
cmark
cmatrix
convertlit
coreutils
cpio
cryptsetup
cups
cups-filters
curl
dav1d
db
dbus
dbus-glib
dconf
desktop-file-utils
device-mapper
dfu-util
dhcpcd
diffutils
discount
discover
djvulibre
dmraid
dnsmasq
dnssec-anchors
dolphin
dolphin-plugins
dosfstools
double-conversion
drkonqi
dtc
e2fsprogs
easy-rsa
ebook-tools
editorconfig-core-c
efibootmgr
efivar
elfutils
ell
enchant
enet
ethtool
ettercap
exa
exiv2
expac
expat
faad2
fakeroot
fd
ffmpeg
ffmpegthumbs
fftw
file
filelight
filesystem
findutils
flac
flex
fmt
fontconfig
frameworkintegration
freeglut
freetype2
frei0r-plugins
fribidi
fuse-common
fuse2
fuse3
gavl
gawk
gc
gcc
gcc-libs
gd
gdb
gdb-common
gdbm
gdk-pixbuf2
geoip
geoip-database
gettext
ghostscript
giflib
git
github-cli
glib-networking
glib2
glibc
glibmm
gloox
glslang
glu
gmp
gnupg
gnutls
go
gobject-introspection-runtime
gperf
gpgme
gpm
gptfdisk
graphene
graphite
grep
groff
grub
grub-customizer
gsettings-desktop-schemas
gsm
gst-plugins-base
gst-plugins-base-libs
gst-plugins-good
gstreamer
gtk-update-icon-cache
gtk-vnc
gtk2
gtk3
gtkglext
gtkmm3
gtksourceview4
guile
gwenview
gzip
handbrake
harfbuzz
harfbuzz-icu
hicolor-icon-theme
hidapi
hiredis
http-parser
hwdata
hwloc
hyphen
iana-etc
icu
id3lib
ijs
imagemagick
imlib2
impacket
inetutils
iniparser
iproute2
iptables-nft
iputils
iso-codes
iwd
jack2
jansson
jasper
java-environment-common
java-runtime-common
jbig2dec
jdk8-openjdk
jre11-openjdk
jre11-openjdk-headless
jre8-openjdk
jre8-openjdk-headless
js78
json-c
json-glib
jsoncpp
kaccounts-integration
kaccounts-providers
kactivities
kactivities-stats
kactivitymanagerd
karchive
kauth
kbd
kbookmarks
kcalc
kcalendarcore
kchmviewer
kcmutils
kcodecs
kcolorpicker
kcompletion
kconfig
kconfigwidgets
kcontacts
kcoreaddons
kcrash
kdbusaddons
kde-cli-tools
kde-gtk-config
kdeclarative
kdeconnect
kdecoration
kded
kdelibs4support
kdenlive
kdeplasma-addons
kdesu
kdialog
kdnssd
kdsoap
kdsoap-ws-discovery-client
kemoticons
keychain
keyutils
kfilemetadata
kgamma5
kglobalaccel
kguiaddons
kholidays
khotkeys
ki18n
kiconthemes
kidletime
kimageannotator
kinfocenter
kio
kio-extras
kio-fuse
kio-gdrive
kirigami2
kitemmodels
kitemviews
kjobwidgets
kjs
kmenuedit
kmod
knewstuff
knights
knotifications
knotifyconfig
kompare
konsole
kpackage
kparts
kpeople
kpeoplevcard
kplotting
kpmcore
kpty
kqtquickcharts
kquickcharts
krb5
kross
krunner
kscreen
kscreenlocker
kservice
ksshaskpass
ksystemstats
ktexteditor
ktextwidgets
ktorrent
ktouch
kunitconversion
kuserfeedback
kwallet
kwallet-pam
kwalletmanager
kwave
kwayland
kwayland-integration
kwayland-server
kwidgetsaddons
kwin
kwindowsystem
kwrited
kxmlgui
l-smash
lame
layer-shell-qt
lcms2
ldb
ldns
less
libaccounts-glib
libaccounts-qt
libaio
libarchive
libass
libassuan
libasyncns
libatasmart
libavc1394
libavif
libblockdev
libbluray
libbpf
libbsd
libburn
libbytesize
libcaca
libcacard
libcanberra
libcap
libcap-ng
libcloudproviders
libcolord
libcroco
libcups
libdaemon
libdatrie
libdbusmenu-qt5
libdca
libde265
libdmtx
libdrm
libdv
libdvbpsi
libdvdread
libebml
libebur128
libedit
libelf
libepoxy
libevdev
libevent
libfakekey
libfbclient
libfdk-aac
libffi
libfontenc
libfreeaptx
libgcrypt
libgit2
libglvnd
libgovirt
libgpg-error
libgudev
libheif
libibus
libical
libice
libid3tag
libidn
libidn2
libiec61883
libimagequant
libimobiledevice
libinih
libinput
libisoburn
libisofs
libjpeg-turbo
libkdcraw
libkdegames
libkexiv2
libkgapi
libkipi
libkomparediff2
libksba
libkscreen
libksysguard
libktorrent
libldac
libldap
liblouis
liblqr
libluv
libmad
libmanette
libmatroska
libmaxminddb
libmbim
libmd
libmfx
libmm-glib
libmnl
libmodplug
libmpc
libmpcdec
libmpeg2
libmtp
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnfs
libnftnl
libnghttp2
libnl
libnm
libnotify
libnsl
libogg
libomxil-bellagio
libosinfo
libp11-kit
libpaper
libpcap
libpciaccess
libpgm
libpipeline
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libqaccessibilityclient
libqalculate
libqmi
libqrtr-glib
libraqm
libraw
libraw1394
librsvg
libsamplerate
libsasl
libseccomp
libsecret
libshout
libsigc++
libsigsegv
libslirp
libsm
libsndfile
libsodium
libsoup
libsoup3
libsoxr
libspectre
libspeechd
libssh
libssh2
libstemmer
libsynctex
libsysprof-capture
libtar
libtasn1
libteam
libtermkey
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libunistring
libunwind
libupnp
liburcu
liburing
libusb
libusbmuxd
libutempter
libuv
libva
libvdpau
libvirt
libvirt-glib
libvirt-python
libvisual
libvorbis
libvpx
libvterm
libwacom
libwebp
libwpe
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmlb
libxmu
libxpm
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxvmc
libxxf86vm
libyaml
libyuv
libzip
licenses
lilv
linux-api-headers
linux-firmware
linux-firmware-whence
linux-zen
linux-zen-headers
llvm-libs
lm_sensors
lmdb
lsb-release
lsof
lua52
lua53
luajit
lv2
lvm2
lz4
lzo
m4
mailcap
make
man-db
mbedtls
md4c
mdadm
media-player-info
mesa
mesa-utils
meson
metasploit
milou
miniupnpc
minizip
mkinitcpio
mkinitcpio-busybox
mkvtoolnix-cli
mkvtoolnix-gui
mlocate
mlt
mobile-broadband-provider-info
modemmanager
modemmanager-qt
mpfr
mpg123
msgpack-c
mtdev
mtools
mtpfs
ncdu
ncurses
ndctl
neofetch
neovim
nettle
networkmanager
networkmanager-qt
nftables
ninja
nmap
node-gyp
nodejs
nodejs-nopt
noto-fonts
noto-fonts-emoji
npm
npth
nspr
nss
ntfs-3g
numactl
obs-studio
okular
oniguruma
openal
openbsd-netcat
opencore-amr
openjpeg2
openmpi
openssh
openssl
openvpn
opus
orc
os-prober
osinfo-db
oxygen
p11-kit
p7zip
pacman
pacman-contrib
pacman-mirrorlist
pahole
pam
pambase
pango
pangomm
parted
partitionmanager
patch
pciutils
pcre
pcre2
perl
perl-error
perl-file-which
perl-locale-gettext
perl-mailtools
perl-term-readkey
perl-timedate
phodav
phonon-qt5
phonon-qt5-vlc
php
pinentry
pipewire
pipewire-media-session
pixman
pkcs11-helper
pkgconf
plasma-browser-integration
plasma-desktop
plasma-disks
plasma-firewall
plasma-framework
plasma-integration
plasma-meta
plasma-nm
plasma-pa
plasma-sdk
plasma-systemmonitor
plasma-thunderbolt
plasma-vault
plasma-workspace
plasma-workspace-wallpapers
polkit
polkit-kde-agent
polkit-qt5
poppler
poppler-qt5
popt
postgresql-libs
potrace
powerdevil
powerline-common
powerline-fonts
powertop
ppp
prison
procps-ng
protobuf
psmisc
pugixml
pulseaudio
pulseaudio-bluetooth
pulseaudio-qt
purpose
python
python-appdirs
python-argcomplete
python-beautifulsoup4
python-cachecontrol
python-cairo
python-cffi
python-chardet
python-click
python-colorama
python-contextlib2
python-cryptography
python-distlib
python-distro
python-dnspython
python-flask
python-future
python-gobject
python-html5lib
python-idna
python-importlib-metadata
python-itsdangerous
python-jinja
python-ldap3
python-markdown
python-markupsafe
python-more-itertools
python-msgpack
python-ordered-set
python-packaging
python-pcapy
python-pefile
python-pep517
python-pexpect
python-pillow
python-pip
python-ply
python-progress
python-psutil
python-ptyprocess
python-pyalsa
python-pyasn1
python-pycodestyle
python-pycparser
python-pycryptodomex
python-pyopenssl
python-pyparsing
python-qrcode
python-requests
python-resolvelib
python-retrying
python-setuptools
python-shiboken2
python-shtab
python-six
python-soupsieve
python-termcolor
python-toml
python-tomli
python-urllib3
python-webencodings
python-werkzeug
python-zipp
python2
qca-qt5
qemu
qpdf
qqc2-desktop-style
qrencode
qt5-base
qt5-declarative
qt5-graphicaleffects
qt5-location
qt5-multimedia
qt5-networkauth
qt5-quickcontrols
qt5-quickcontrols2
qt5-script
qt5-sensors
qt5-speech
qt5-svg
qt5-tools
qt5-translations
qt5-wayland
qt5-webchannel
qt5-webengine
qt5-x11extras
qt5-xmlpatterns
rav1e
re2
readline
rest
rhash
ripgrep
rmlint
rtkit
ruby
ruby-irb
ruby-reline
ruby2.7
rubygems
run-parts
sbc
scrcpy
sddm
sddm-kcm
sdl2
sdl2_image
seabios
sed
semver
serd
shaderc
shadow
shared-mime-info
signon-kwallet-extension
signon-plugin-oauth2
signon-ui
signond
slang
smartmontools
smbclient
snappy
socat
solid
sonnet
sord
sound-theme-freedesktop
source-highlight
spandsp
spectacle
speex
speexdsp
spice
spice-gtk
spirv-tools
sqlite
sratom
srt
sshfs
startup-notification
sudo
svt-av1
syndication
syntax-highlighting
sysfsutils
systemd
systemd-libs
systemd-sysvcompat
systemsettings
t1lib
taglib
talloc
tar
tcl
tdb
tevent
texinfo
texlive-bin
texlive-core
texlive-fontsextra
texlive-formatsextra
texlive-langextra
texlive-latexextra
texlive-science
thin-provisioning-tools
threadweaver
tldr
tracker3
tree
tree-sitter
tslib
ttf-fira-code
ttf-hack
ttf-liberation
twolame
tzdata
udisks2
ufw
unibilium
unixodbc
unzip
upower
usbmuxd
usbredir
util-linux
util-linux-libs
v4l-utils
vde2
vi
vid.stab
vim
vim-runtime
virglrenderer
virt-install
virt-manager
virt-viewer
vlc
vmaf
vnstat
volume_key
vte-common
vte3
vulkan-icd-loader
vulkan-intel
vulkan-tools
w3m
wavpack
wayland
wayland-protocols
wayland-utils
webrtc-audio-processing
wget
which
wireshark-cli
wireshark-qt
woff2
wpa_supplicant
wpebackend-fdo
wxgtk-common
wxgtk3
x264
x265
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xdg-dbus-proxy
xdg-desktop-portal-kde
xdg-user-dirs
xdg-utils
xf86-input-libinput
xf86-video-intel
xf86-video-vesa
xfsprogs
xkeyboard-config
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-alias-100dpi
xorg-fonts-alias-75dpi
xorg-fonts-encodings
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-util-macros
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmessage
xorg-xmodmap
xorg-xpr
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwayland
xorg-xwd
xorg-xwininfo
xorg-xwud
xorgproto
xvidcore
xz
yajl
yakuake
yarn
youtube-dl
zeromq
zimg
zita-alsa-pcmi
zita-resampler
zlib
zsh
zstd
zxing-cpp
zziplib
